// Напишите программу, которая принимает на вход число 
//и выдаёт количество цифр в числе.
void NumLenght(int num)
{
    string a = num.ToString();
    Console.WriteLine(a.Length);
}
NumLenght(2568);